HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC5_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC5_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC5_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC5_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC5_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC5_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC5_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC5_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC5_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC5_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00615B2u)

/** \\brief  C, Revision ID Register */
#define MC5_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006150Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc6
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC6_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061600u)

/** \\brief  2, Configuration Register 1 */
#define MC6_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061602u)

/** \\brief  10, Memory ECC Detection Register */
#define MC6_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061610u)

/** \\brief  E, ECC Safety Register */
#define MC6_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006160Eu)

/** \\brief  12, Error Tracking Register */
#define MC6_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061612u)

/** \\brief  14, Error Tracking Register */
#define MC6_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061614u)

/** \\brief  16, Error Tracking Register */
#define MC6_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061616u)

/** \\brief  18, Error Tracking Register */
#define MC6_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061618u)

/** \\brief  4, MBIST Control Register */
#define MC6_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061604u)

/** \\brief  6, Status Register */
#define MC6_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061606u)

/** \\brief  8, Range Register, single address mode */
#define MC6_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061608u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC6_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC6_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC6_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC6_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC6_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC6_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC6_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC6_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC6_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC6_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC6_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC6_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC6_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC6_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC6_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC6_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC6_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC6_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC6_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC6_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC6_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC6_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC6_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC6_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC6_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC6_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC6_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC6_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC6_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC6_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00616E6u)

