HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC23_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC23_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC23_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC23_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC23_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC23_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC23_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC23_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC23_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC23_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627B2u)

/** \\brief  C, Revision ID Register */
#define MC23_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006270Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc24
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC24_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062800u)

/** \\brief  2, Configuration Register 1 */
#define MC24_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062802u)

/** \\brief  10, Memory ECC Detection Register */
#define MC24_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062810u)

/** \\brief  E, ECC Safety Register */
#define MC24_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006280Eu)

/** \\brief  12, Error Tracking Register */
#define MC24_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062812u)

/** \\brief  14, Error Tracking Register */
#define MC24_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062814u)

/** \\brief  16, Error Tracking Register */
#define MC24_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062816u)

/** \\brief  18, Error Tracking Register */
#define MC24_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062818u)

/** \\brief  4, MBIST Control Register */
#define MC24_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062804u)

/** \\brief  6, Status Register */
#define MC24_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062806u)

/** \\brief  8, Range Register, single address mode */
#define MC24_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062808u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC24_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC24_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC24_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC24_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC24_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC24_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC24_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC24_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC24_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC24_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC24_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC24_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC24_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC24_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC24_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC24_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC24_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC24_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC24_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC24_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC24_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC24_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC24_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC24_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC24_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC24_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC24_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC24_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC24_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC24_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00628E6u)

