HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC28_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC28_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC28_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC28_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC28_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC28_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC28_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC28_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC28_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC28_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062CB2u)

/** \\brief  C, Revision ID Register */
#define MC28_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0062C0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc29
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC29_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062D00u)

/** \\brief  2, Configuration Register 1 */
#define MC29_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062D02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC29_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062D10u)

/** \\brief  E, ECC Safety Register */
#define MC29_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0062D0Eu)

/** \\brief  12, Error Tracking Register */
#define MC29_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062D12u)

/** \\brief  14, Error Tracking Register */
#define MC29_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062D14u)

/** \\brief  16, Error Tracking Register */
#define MC29_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062D16u)

/** \\brief  18, Error Tracking Register */
#define MC29_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062D18u)

/** \\brief  4, MBIST Control Register */
#define MC29_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062D04u)

/** \\brief  6, Status Register */
#define MC29_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062D06u)

/** \\brief  8, Range Register, single address mode */
#define MC29_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062D08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC29_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC29_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC29_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC29_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC29_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC29_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC29_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC29_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC29_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC29_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC29_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC29_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC29_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC29_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC29_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC29_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC29_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC29_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC29_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC29_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC29_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC29_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC29_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC29_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC29_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC29_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC29_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC29_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC29_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC29_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062DE6u)

