HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC36_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC36_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC36_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC36_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC36_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC36_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC36_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC36_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC36_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC36_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00634B2u)

/** \\brief  C, Revision ID Register */
#define MC36_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006340Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc37
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC37_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063500u)

/** \\brief  2, Configuration Register 1 */
#define MC37_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063502u)

/** \\brief  10, Memory ECC Detection Register */
#define MC37_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063510u)

/** \\brief  E, ECC Safety Register */
#define MC37_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006350Eu)

/** \\brief  12, Error Tracking Register */
#define MC37_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063512u)

/** \\brief  14, Error Tracking Register */
#define MC37_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063514u)

/** \\brief  16, Error Tracking Register */
#define MC37_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063516u)

/** \\brief  18, Error Tracking Register */
#define MC37_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063518u)

/** \\brief  4, MBIST Control Register */
#define MC37_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063504u)

/** \\brief  6, Status Register */
#define MC37_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063506u)

/** \\brief  8, Range Register, single address mode */
#define MC37_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063508u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC37_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC37_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC37_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC37_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC37_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC37_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC37_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC37_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC37_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC37_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC37_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC37_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC37_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC37_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC37_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC37_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC37_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC37_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC37_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC37_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC37_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC37_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC37_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC37_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC37_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC37_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC37_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC37_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC37_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC37_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00635E6u)

