HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC56_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC56_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC56_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC56_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC56_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC56_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC56_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC56_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC56_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC56_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648B2u)

/** \\brief  C, Revision ID Register */
#define MC56_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006480Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc57
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC57_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064900u)

/** \\brief  2, Configuration Register 1 */
#define MC57_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064902u)

/** \\brief  10, Memory ECC Detection Register */
#define MC57_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064910u)

/** \\brief  E, ECC Safety Register */
#define MC57_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006490Eu)

/** \\brief  12, Error Tracking Register */
#define MC57_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064912u)

/** \\brief  14, Error Tracking Register */
#define MC57_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064914u)

/** \\brief  16, Error Tracking Register */
#define MC57_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064916u)

/** \\brief  18, Error Tracking Register */
#define MC57_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064918u)

/** \\brief  4, MBIST Control Register */
#define MC57_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064904u)

/** \\brief  6, Status Register */
#define MC57_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064906u)

/** \\brief  8, Range Register, single address mode */
#define MC57_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064908u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC57_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC57_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC57_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC57_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC57_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC57_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC57_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC57_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC57_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC57_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC57_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC57_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC57_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC57_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC57_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC57_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC57_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC57_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC57_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC57_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC57_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC57_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC57_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC57_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC57_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC57_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC57_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC57_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC57_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC57_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00649E6u)

