HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC59_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC59_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC59_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC59_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC59_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC59_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC59_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC59_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC59_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC59_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064BB2u)

/** \\brief  C, Revision ID Register */
#define MC59_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc60
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC60_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064C00u)

/** \\brief  2, Configuration Register 1 */
#define MC60_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064C02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC60_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064C10u)

/** \\brief  E, ECC Safety Register */
#define MC60_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0064C0Eu)

/** \\brief  12, Error Tracking Register */
#define MC60_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C12u)

/** \\brief  14, Error Tracking Register */
#define MC60_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C14u)

/** \\brief  16, Error Tracking Register */
#define MC60_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C16u)

/** \\brief  18, Error Tracking Register */
#define MC60_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064C18u)

/** \\brief  4, MBIST Control Register */
#define MC60_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064C04u)

/** \\brief  6, Status Register */
#define MC60_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064C06u)

/** \\brief  8, Range Register, single address mode */
#define MC60_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064C08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC60_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC60_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC60_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC60_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC60_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC60_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC60_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC60_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC60_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC60_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC60_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC60_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC60_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC60_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC60_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC60_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC60_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC60_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC60_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC60_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC60_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC60_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC60_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC60_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC60_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC60_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC60_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC60_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC60_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC60_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064CE6u)

