HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC65_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC65_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC65_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC65_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC65_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC65_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC65_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC65_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC65_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC65_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00651B2u)

/** \\brief  C, Revision ID Register */
#define MC65_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006510Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc66
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC66_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065200u)

/** \\brief  2, Configuration Register 1 */
#define MC66_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065202u)

/** \\brief  10, Memory ECC Detection Register */
#define MC66_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065210u)

/** \\brief  E, ECC Safety Register */
#define MC66_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006520Eu)

/** \\brief  12, Error Tracking Register */
#define MC66_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065212u)

/** \\brief  14, Error Tracking Register */
#define MC66_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065214u)

/** \\brief  16, Error Tracking Register */
#define MC66_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065216u)

/** \\brief  18, Error Tracking Register */
#define MC66_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065218u)

/** \\brief  4, MBIST Control Register */
#define MC66_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065204u)

/** \\brief  6, Status Register */
#define MC66_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065206u)

/** \\brief  8, Range Register, single address mode */
#define MC66_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065208u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC66_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC66_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC66_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC66_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC66_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC66_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC66_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC66_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC66_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC66_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC66_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC66_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC66_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC66_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC66_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC66_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC66_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC66_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC66_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC66_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC66_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC66_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC66_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC66_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC66_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC66_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC66_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC66_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC66_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC66_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00652E6u)

