HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC81_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC81_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC81_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC81_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC81_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC81_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC81_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC81_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC81_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC81_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00661B2u)

/** \\brief  C, Revision ID Register */
#define MC81_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006610Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc82
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC82_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066200u)

/** \\brief  2, Configuration Register 1 */
#define MC82_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066202u)

/** \\brief  10, Memory ECC Detection Register */
#define MC82_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066210u)

/** \\brief  E, ECC Safety Register */
#define MC82_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006620Eu)

/** \\brief  12, Error Tracking Register */
#define MC82_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066212u)

/** \\brief  14, Error Tracking Register */
#define MC82_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066214u)

/** \\brief  16, Error Tracking Register */
#define MC82_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066216u)

/** \\brief  18, Error Tracking Register */
#define MC82_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066218u)

/** \\brief  4, MBIST Control Register */
#define MC82_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066204u)

/** \\brief  6, Status Register */
#define MC82_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066206u)

/** \\brief  8, Range Register, single address mode */
#define MC82_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066208u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC82_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC82_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC82_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC82_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC82_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC82_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC82_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC82_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC82_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC82_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC82_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC82_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC82_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC82_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC82_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC82_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC82_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC82_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC82_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC82_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC82_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC82_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC82_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC82_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC82_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC82_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC82_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC82_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC82_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC82_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00662E6u)

