HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC85_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC85_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC85_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC85_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC85_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC85_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC85_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC85_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC85_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC85_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00665B2u)

/** \\brief  C, Revision ID Register */
#define MC85_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006650Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc86
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC86_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0066600u)

/** \\brief  2, Configuration Register 1 */
#define MC86_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0066602u)

/** \\brief  10, Memory ECC Detection Register */
#define MC86_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0066610u)

/** \\brief  E, ECC Safety Register */
#define MC86_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006660Eu)

/** \\brief  12, Error Tracking Register */
#define MC86_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066612u)

/** \\brief  14, Error Tracking Register */
#define MC86_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066614u)

/** \\brief  16, Error Tracking Register */
#define MC86_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066616u)

/** \\brief  18, Error Tracking Register */
#define MC86_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0066618u)

/** \\brief  4, MBIST Control Register */
#define MC86_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0066604u)

/** \\brief  6, Status Register */
#define MC86_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0066606u)

/** \\brief  8, Range Register, single address mode */
#define MC86_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0066608u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC86_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC86_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC86_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC86_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC86_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC86_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC86_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC86_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC86_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC86_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC86_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC86_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC86_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC86_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC86_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC86_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC86_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC86_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC86_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC86_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC86_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC86_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC86_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC86_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC86_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC86_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC86_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC86_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC86_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC86_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00666E6u)

